AUTO_config_TK_pesok/src/InformationRegisters/ТК_ОчередьПечатиТСД/ТК_ОчередьПечатиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ОчередьПечатиТСД</name>
  <resources>
    <name>Статус</name>
    <comment>0 - Новый 1 - отправлен на печать 2-ошибка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Ошибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Копий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Макет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ОчередьПечатиТСД/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция ПоказатьПечатнуюФормуНаСервере(МассивСтрок)
	
	Табдок = Новый ТабличныйДокумент;
	Для Каждого Стр Из МассивСтрок Цикл 
		
		Очередь = РегистрыСведений.ТК_ОчередьПечатиТСД.СоздатьМенеджерЗаписи();
		Очередь.Дата = Стр.Дата;
		Очередь.ТорговаяПлощадка = Стр.ТорговаяПлощадка;
		Очередь.СкладКомпании = Стр.СкладКомпании;
		Очередь.Макет = Стр.Макет;
		Очередь.Прочитать();
		Если Очередь.Выбран() Тогда
			текТабДок = Очередь.Хранилище.Получить();
			Если Табдок = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Табдок.Вывести(текТабДок);
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	Возврат Табдок;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПечатнуюФорму(Команда)
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;

	ТабличныйДокумент = ПоказатьПечатнуюФормуНаСервере(МассивСтрок);
	ТабличныйДокумент.Показать();
КонецПроцедуры
